dmytrolutsyk/gimball-stm32/Src/bno055_support.c
    /*************read raw Euler data************/
    /* variable used to read the euler h data */
    s16 euler_data_h = BNO055_INIT_VALUE;

    /* variable used to read the euler r data */
    s16 euler_data_r = BNO055_INIT_VALUE;

    /* variable used to read the euler p data */
    s16 euler_data_p = BNO055_INIT_VALUE;

    /* structure used to read the euler hrp data */
    struct bno055_euler_t euler_hrp;

    /************read raw quaternion data**************/
    /* variable used to read the quaternion w data */
    s16 quaternion_data_w = BNO055_INIT_VALUE;

    /* variable used to read the quaternion x data */
    s16 quaternion_data_x = BNO055_INIT_VALUE;

    /* variable used to read the quaternion y data */
    s16 quaternion_data_y = BNO055_INIT_VALUE;

    /* variable used to read the quaternion z data */
    s16 quaternion_data_z = BNO055_INIT_VALUE;

    /* structure used to read the quaternion wxyz data */
    struct bno055_quaternion_t quaternion_wxyz;

    /************read raw linear acceleration data***********/
    /* variable used to read the linear accel x data */
    s16 linear_accel_data_x = BNO055_INIT_VALUE;

    /* variable used to read the linear accel y data */
    s16 linear_accel_data_y = BNO055_INIT_VALUE;

    /* variable used to read the linear accel z data */
    s16 linear_accel_data_z = BNO055_INIT_VALUE;

    /* structure used to read the linear accel xyz data */
    struct bno055_linear_accel_t linear_acce_xyz;

    /*****************read raw gravity sensor data****************/
    /* variable used to read the gravity x data */
    s16 gravity_data_x = BNO055_INIT_VALUE;

    /* variable used to read the gravity y data */
    s16 gravity_data_y = BNO055_INIT_VALUE;

    /* variable used to read the gravity z data */
    s16 gravity_data_z = BNO055_INIT_VALUE;

    /* structure used to read the gravity xyz data */
    struct bno055_gravity_t gravity_xyz;

    /*************read accel converted data***************/
    /* variable used to read the accel x data output as m/s2 or mg */
    double d_accel_datax = BNO055_INIT_VALUE;

    /* variable used to read the accel y data output as m/s2 or mg */
    double d_accel_datay = BNO055_INIT_VALUE;

    /* variable used to read the accel z data output as m/s2 or mg */
    double d_accel_dataz = BNO055_INIT_VALUE;

    /* structure used to read the accel xyz data output as m/s2 or mg */
    struct bno055_accel_double_t d_accel_xyz;

    /******************read mag converted data********************/
    /* variable used to read the mag x data output as uT*/
    double d_mag_datax = BNO055_INIT_VALUE;

    /* variable used to read the mag y data output as uT*/
    double d_mag_datay = BNO055_INIT_VALUE;

    /* variable used to read the mag z data output as uT*/
    double d_mag_dataz = BNO055_INIT_VALUE;

    /* structure used to read the mag xyz data output as uT*/
    struct bno055_mag_double_t d_mag_xyz;

    /*****************read gyro converted data************************/
    /* variable used to read the gyro x data output as dps or rps */
    double d_gyro_datax = BNO055_INIT_VALUE;

    /* variable used to read the gyro y data output as dps or rps */
    double d_gyro_datay = BNO055_INIT_VALUE;

    /* variable used to read the gyro z data output as dps or rps */
    double d_gyro_dataz = BNO055_INIT_VALUE;

    /* structure used to read the gyro xyz data output as dps or rps */
    struct bno055_gyro_double_t d_gyro_xyz;

    /*******************read euler converted data*******************/

    /* variable used to read the euler h data output
     * as degree or radians*/
    double d_euler_data_h = BNO055_INIT_VALUE;

    /* variable used to read the euler r data output
     * as degree or radians*/
    double d_euler_data_r = BNO055_INIT_VALUE;

    /* variable used to read the euler p data output
     * as degree or radians*/
    double d_euler_data_p = BNO055_INIT_VALUE;

    /* structure used to read the euler hrp data output
     * as as degree or radians */
    struct bno055_euler_double_t d_euler_hpr;

    /*********read linear acceleration converted data**********/
    /* variable used to read the linear accel x data output as m/s2*/
    double d_linear_accel_datax = BNO055_INIT_VALUE;

    /* variable used to read the linear accel y data output as m/s2*/
    double d_linear_accel_datay = BNO055_INIT_VALUE;

    /* variable used to read the linear accel z data output as m/s2*/
    double d_linear_accel_dataz = BNO055_INIT_VALUE;

    /* structure used to read the linear accel xyz data output as m/s2*/
    struct bno055_linear_accel_double_t d_linear_accel_xyz;

    /********************Gravity converted data**********************/
    /* variable used to read the gravity sensor x data output as m/s2*/
    double d_gravity_data_x = BNO055_INIT_VALUE;

    /* variable used to read the gravity sensor y data output as m/s2*/
    double d_gravity_data_y = BNO055_INIT_VALUE;

    /* variable used to read the gravity sensor z data output as m/s2*/
    double d_gravity_data_z = BNO055_INIT_VALUE;

    /* structure used to read the gravity xyz data output as m/s2*/
    struct bno055_gravity_double_t d_gravity_xyz;

    /*---------------------------------------------------------------------------*
     *********************** START INITIALIZATION ************************
     *--------------------------------------------------------------------------*/
#ifdef  BNO055_API

    /*  Based on the user need configure I2C interface.
     *  It is example code to explain how to use the bno055 API*/
    I2C_routine();
#endif

    /*--------------------------------------------------------------------------*
     *  This API used to assign the value/reference of
     *  the following parameters
     *  I2C address
     *  Bus Write
     *  Bus read
     *  Chip id
     *  Page id
     *  Accel revision id
     *  Mag revision id
     *  Gyro revision id
     *  Boot loader revision id
     *  Software revision id
     *-------------------------------------------------------------------------*/
    comres = bno055_init(&bno055);

    /*  For initializing the BNO sensor it is required to the operation mode
     * of the sensor as NORMAL
     * Normal mode can set from the register
     * Page - page0
     * register - 0x3E
     * bit positions - 0 and 1*/
    power_mode = BNO055_POWER_MODE_NORMAL;

